{
  "job.title": "Freelance Software Engineer",
  "page.title.services": "Services",
  "company.name": "Dieter Jordens IT Consulting",
  "company.goal": "The main goal of my company is to make a nice contribution to society. On the one hand by delivering high quality work for customers. Software that does exactly what you want, reliable and valuable. On the other hand, by focusing on knowledge sharing, both within and outside the team.",
  "company.history": "Dieter Jordens IT Consulting BV was founded in May 2021. Many projects require external expertise, because the digital world continues to evolve. By putting a lot of effort into gathering and sharing knowledge, we are constantly improving and we also push the people we work with to a higher level.",
  "company.difference.with.competition": "Many consultancy companies do not invest enough in knowledge sharing. As a result, the level of software engineering does not improve. You, as a client, then pay too much, because you could also employ that person directly. That is a waste. By starting my own company, I ensure that this will not be the case for my clients.",
  "service.software.development": "Software Development",
  "service.software.development.focus": "Software development is all about creating value. The focus is on exciting, high-impact assignments with a nice social contribution. That is often where the greatest challenges lie and that is fascinating. Our focus is mainly on projects in which data is central.",
  "service.software.development.current.workstatus": "My company is currently working on an assignment for Aquafin. My assignment has been extended recently to September 2022.",
  "service.software.development.next.assignment": "Do you have an interesting assignment and are you looking for someone (or a team) to bring it to a successful conclusion? Then feel free to send me an e-mail. Thanks to my years of expertise, I have, besides myself, an extensive network of professionals to fall back on.",
  "service.coaching": "Coaching",
  "service.coaching.focus": "Everybody needs personal guidance. It is difficult to keep up with all the technological developments. It is there that we as a coach can make a difference. Instead of putting pressure on employees to prepare a workshop after hours, it is better to hire a professional. That way, you take care of your people and your company benefits, a win-win situation.",
  "service.coaching.current.workstatus": "Covid-19 made it difficult to start up my activities as a coach so far. Last year, I gave an online session at two foreign conferences, but I missed human interaction.",
  "service.coaching.next.assignment": "Do you need career advice or are you looking for someone to give a workshop/talk on a certain subject? Then feel free to contact us, so that together we can prepare a tailor-made offer.",
  "service.partnership": "Working together?",
  "partnership.assignments": "As a company, I am constantly looking for new assignments (large or small). I prefer to work directly with a company, but it is also possible to work with a partner.",
  "partnership.developers": "Are you a developer looking for a new, cool work experience? Then you have come to the right place. I am looking for enthusiastic developers who want to contribute to this story.",
  "partnership.reason": "By working together, you achieve much more. Some work assignments are too big to tackle alone. That is why expansion is necessary in the future, to meet the demand and to extend the area of knowledge.",
  "page.title.vision": "Vision",
  "vision.subtitle": "Entrust Your Work To Someone Who Values Quality",
  "vision.intro": "Research shows that large software projects often fail. Despite many changes in the way software is developed, this is still the case. A combination of internal and external software developers is healthy for companies. That way you can build on what is good, and new knowledge and experience flows into the company. If you want the best for your business, you should seek advice. By making one right decision after another, you move forward. Decisions that allow for rapid growth, both now and in the future. That's why you need crafts(wo)men. People with experience, who know the short and long-term impact of their decisions. But how do you recognise crafts(wo)men? The four principles below will give you an idea of what to look out for.",
  "vision.working.software": "Working Software",
  "vision.software.quality": "Good software does what it needs to do. And, continues to do so. You must therefore listen carefully to what the customer wants. And the software needs to meet new demands. You better do it with quality, or you will pay a big price afterwards.",
  "vision.keep.learning": "To become an expert in your field, you have to keep learning. Whether you are twenty or fifty, you can always learn something. You learn good habits and you have to get rid of bad ones. To do that, you have to remain critical of your own working methods.",
  "vision.testing": "Anyone who has been developing software for years has discovered that you can actually avoid most bugs. If you test before writing code, the rest of the program will always work. That is why test-driven development is so important. It allows you to work faster. Not because writing tests does not take time, but because your application is not full of bugs. A well-developed application is a dream for a developer. And that's good news for the customer, because you can change quickly, without spending all money on maintenance.",
  "vision.change": "Responding to Change",
  "vision.rapid.progress": "In order to develop software properly, you want to add value gradually. Every day, you want to deliver top quality code or value for your business. To do this, you have to be honest with yourself and with the customer. You cannot take on too much, and you must be clear about what you can deliver and when.",
  "vision.honesty": "In our job, we often get asked for an estimate. In order to give good estimates, you often have to split up tasks. By properly indicating what is feasible, in what timeframe, the customer can indicate what the priority really is. As a developer, you have to be honest, even when you are under pressure. Honesty is the best policy.",
  "vision.good.communication": "Actually, it comes down to good communication. By giving good estimates, clients know what they can expect. A partner who makes promises and is unable to keep them is of no use to you. In addition, you want the focus to be right. You don't want to spend money on something you don't need. Reliability, that is important.",
  "vision.individuals.and.interactions": "Individuals and Interactions",
  "vision.discussions": "Fortunately, everyone has different opinions and a different personality. That is what makes life interesting. But when it comes down to what a customer needs, you have to have meaningful discussions. Substantiated, with real arguments.",
  "vision.learn.and.adapt": "To move forward, you have to re-evaluate things that have been decided in the past. It takes a lot of courage to admit previous mistakes. That is why it is important to work together with other crafts(wo)men. It's one thing to be proud of your work, if you can do better, you should do so. It is better to work with people who have their heart in the right place than with people who do not care about the project or the organisation.",
  "vision.knowledge.sharing": "A knowledge-sharing community is important. You can share knowledge by working directly with someone. But it can also be done through knowledge sessions, coaching and content creation. To know is to move forward.",
  "vision.customer.collaboration": "Collaboration",
  "vision.long.term.relationships": "To really make a difference to an organisation, you have to go through a project lasting from months to years. You don't build an application in a day. With good collaboration, you can achieve a lot in a few months time. But it doesn't have to stop after a few months. Every organization has exciting opportunities, in that case it's in both interest that you can collaborate for a long period of time.",
  "vision.contract.negotiation": "It is important that the vision of the customer and the vision of the developer correspond well. Good collaboration can only come about if the developer feels that his work really matters. If working together is fun, you can achieve so much more. Collaboration is more important than contract negotiation.",
  "projects.title": "Projects",
  "projects.subtitle": "We all have a timeline",
  "projects.intro": "What is the ideal project? Difficult question to answer. Instead of focusing on the technology, we should focus on its purpose. Every project contributes to you as an individual, but it is the 'why' for which you do it. Below you will find a timeline. It gives you an insight into my most recent projects. Do you have a challenge for which you have difficulty finding the right profile? Then definitely get in touch!",
  "books.title": "Books",
  "books.subtitle": "A writer only begins a book, a reader finishes it",
  "books.intro": "One of the best ways to gain knowledge is by reading. These do not always have to be technical books. Below are books that I have come across and read in my career. Many of these books contain valuable information, some more than others. Each book has therefore been given a score, from zero to five. They are very varied, from very technical books to soft skills.",
  "career.title": "Career",
  "career.subtitle": "Our future is simply the result of choices we have made",
  "career.intro": "My passion for software development and data did not come from my birth. During my studies, I was more interested in science, mathematics and sports. As I grew older, my interest increased. I learned how to program during my studies and it has stuck with me ever since. Meanwhile, I have been programming for more than 10 years, the last 6 professionally. I still like to learn every day, and I do it with a lot of passion. It is exciting to see what the future holds for me!",
  "blog.subtitle": "If writing is easy, you're doing it wrong",
  "blog.intro": "The world wide web is filled with information, which developers eagerly use for research. Access to knowledge is essential to do your job well and to grow. If you've ever done some research, you understand the importance of sharing knowledge. When you have trouble finding an answer, that's an opportunity to write a quality article. This is how we can contribute to the community. This is how we give back."
}
