{
  "job.title": "Zelfstandig Software Ontwikkelaar",
  "page.title.services": "Diensten",
  "company.name": "Dieter Jordens IT Consulting",
  "company.goal": "Het hoofddoel van mijn bedrijf is om een mooie bijdrage te leveren aan de maatschappij. Enerzijds door hoogstaand kwalitatief werk op te leveren voor klanten. Software die exact doet wat je wenst, betrouwbaar en waardevol. Anderzijds door in te zetten op kennisdeling, zowel binnen als buiten het team.",
  "company.history": "Dieter Jordens IT Consulting BV werd in mei 2021 opgericht. Veel projecten hebben externe expertise nodig, omdat de digitale wereld niet stilstaat. Door heel hard in te zetten op het vergaren en delen van kennis, tillen wij ons werk en de mensen waarmee we samenwerken steeds naar een hoger niveau.",
  "company.difference.with.competition": "Veel consultancy bedrijven zetten te weinig in op kennisdeling. Hierdoor tillen ze het niveau bij de klant niet omhoog. Jij, als klant, betaalt dan te veel, want je zou die persoon ook vast in dienst kunnen nemen. Dat is zonde. Door mijn eigen bedrijf te beginnen, kan ik erover waken dat dit niet het geval is voor mijn klanten.",
  "service.software.development": "Software Ontwikkeling",
  "service.software.development.focus": "Software ontwikkeling draait om waarde creëren. De focus ligt op boeiende, impactvolle opdrachten met een mooie maatschappelijke bijdrage. Daar liggen vaak de grootste uitdagingen en dat is uitermate boeiend. Onze expertise bestaat voornamelijk uit projecten waarin data centraal staat.",
  "service.software.development.current.workstatus": "Mijn bedrijf werkt momenteel een werkopdracht voor Aquafin uit. Mijn opdracht werd recent verlengd tot september 2022.",
  "service.software.development.next.assignment": "Heb jij een interessante opdracht en zoek je iemand (of een team) om dit tot een goed einde te brengen? Stuur mij dan gerust een mailtje. Dankzij mijn jaren expertise heb ik, naast mijzelf, een uitgebreid netwerk van professionals om op terug te vallen.",
  "service.coaching": "Coaching",
  "service.coaching.focus": "Iedereen heeft nood aan persoonlijke begeleiding. Het is vaak moeilijk om bij te blijven met alle technologische ontwikkelingen. Het is daar dat we als coach een verschil kunnen maken. In de plaats van druk te leggen bij werknemers om na hun uren nog een workshop voor te bereiden, huur je beter een professional in. Zo ontzorg je jouw mensen en ga je er als bedrijf op vooruit, een win-win situatie.",
  "service.coaching.current.workstatus": "Covid-19 maakte het moeilijk om mijn activiteiten als coach tot dusver op te starten. Vorig jaar gaf ik nog een online sessie op twee buitenlandse conferenties, maar ik miste daarbij menselijke interactie.",
  "service.coaching.next.assignment": "Heb je nood aan carrière advies of zoek je iemand die een workshop/talk kan geven over een bepaald onderwerp? Neem dan gerust contact op, zodat we samen een offerte op maat kunnen opstellen.",
  "service.partnership": "Samenwerken?",
  "partnership.assignments": "Als bedrijf ben ik voortdurend op zoek naar nieuwe opdrachten (groot of klein). Liefst werk ik rechtstreeks samen met een bedrijf, maar dat mag ook via een opdrachtgever.",
  "partnership.developers": "Ben je als ontwikkelaar op zoek naar een nieuwe, toffe werkervaring? Dan ben je aan het juiste adres. Ik ben op zoek naar enthousiaste ontwikkelaars die mee willen schrijven aan dit verhaal.",
  "partnership.reason": "Door samen te werken bereik je veel meer. Sommige werkopdrachten zijn te groot om alleen aan te pakken. Daarom is uitbreiding in de toekomst nodig, om aan de vraag te kunnen voldoen en het kennisgebied uit te breiden.",
  "page.title.vision": "Visie",
  "vision.subtitle": "Vertrouw Je Werk Toe Aan Mensen Met Vakkennis",
  "vision.intro": "Onderzoek heeft aangetoond dat grote software projecten vaak falen. Ondanks de vele wijzigingen in de manier waarop software wordt ontwikkeld, is dit nog vaak het geval. Een combinatie van internen en externen is gezond voor bedrijven. Op die manier kan je verder bouwen op wat goed is en zorg je ervoor dat er nieuwe kennis en ervaring binnenstroomt in je bedrijf. Als je het beste met je bedrijf voorhebt, win je regelmatig advies in. Door de ene doordachte beslissing na de andere te nemen, ga je vooruit. Deze beslissingen moeten snelle groei toelaten, zowel nu als in de toekomst. Daarom heb je vakmensen nodig. Mensen met ervaring, die de korte- en lange termijn impact van beslissingen goed kunnen inschatten. Maar hoe herken je vakmensen? De vier principes hier beneden, geven je een idee van naar wat je precies moet uitkijken.",
  "vision.working.software": "Werkende Code",
  "vision.software.quality": "Goede code doet wat het moet doen. En, blijft werken. Het is belangrijk om goed te luisteren naar wat de klant juist wil. Tenslotte moet de geschreven software ook klaar zijn voor mogelijke veranderingen. Oog voor kwaliteit vanaf het prille begin is dus belangrijk, of je gaat in de toekomst hiervoor een grote prijs betalen.",
  "vision.keep.learning": "Om een expert in je veld te worden, moet je blijven leren. Of je nu twintig of vijftig bent, je weet nooit alles. Doorheen je leven bouw je voortdurend goede gewoontes op en tracht je slechte gewoontes af te leren. Je moet jezelf en je werkmethodes dus constant in vraag blijven stellen.",
  "vision.testing": "Iedereen die al enkele jaren software ontwikkeld heeft, ontdekt dat je de meeste bugs eigenlijk kan voorkomen. Om honderd procent zeker te zijn dat je wijziging correct is, moet je testen. Zo weet je wat er nu al werkt en zo weet je ook als je iets van oude functionaliteit stuk maakt. Ik schrijf meestal een test voor ik een wijziging doe. Hierdoor garandeer ik dat alles werkt zoals we dat willen, nu en in de toekomst. Dit laat me toe om snel te werken. Testen kost natuurlijk tijd, maar omdat je applicatie niet vol bugs zit, kan je je full-time bezig houden met ontwikkeling. Zo'n applicatie is de droom voor elke ontwikkelaar. En natuurlijk is dat goed nieuws voor de klant, want zo kan hij in de toekomst makkelijk zaken wijzigen, zonder dat al zijn geld naar onderhoud gaat.",
  "vision.change": "Continu Vooruitgaan",
  "vision.rapid.progress": "Als je een project maakt, werk je daar gedurende lange tijd aan. Elke gewerkte dag voeg je nieuwe functionaliteit toe, test je dit grondig en verwerk je de feedback van de eindgebuikers. Elke dag, moet je er dus 100% met je gedachten bij zijn, om het beste van jezelf te kunnen geven. Om dit te doen, moet je eerlijk zijn voor jezelf en voor de klant. Je neemt niet te veel hooi op je vork en je bent realistisch over wat je kan opleveren en wanneer.",
  "vision.honesty": "In onze job vraagt de klant regelmatig om een inschatting van het werk voor handen. Om een goede schatting te kunnen geven, is het belangrijk om je werk op te delen in kleine, afzonderlijke stukken. Dan kan je aangeven, wat mogelijk is en op welke termijn. Het is hierbij belangrijk dat je focust op wat het meest waardevol is voor de klant. Dat is je prioriteit. Als ontwikkelaar moet je eerlijk zijn, zelfs wanneer je onder druk staat. Eerlijkheid duurt het langst.",
  "vision.good.communication": "Wat misschien nog het belangrijkst is om vooruitgang te boeken is goede communicatie. Door duidelijk te zijn naar elkaar, weet de klant exact wat hij kan verwachten. Een partner die beloftes maakt en deze niet nakomt, daar heb je niets aan. Daarenboven, wil je een goede focus. Je wil geen geld uitgeven aan nutteloze zaken. Alleen als je op één lijn zit, maak je snel vooruitgang.",
  "vision.individuals.and.interactions": "Individuen en Iteracties",
  "vision.discussions": "Gelukkig, heeft iedereen zijn eigen mening en een unieke persoonlijkheid. Anders zou het leven saai zijn, en zo vervelen we ons niet snel. Maar wanneer het neerkomt op wat de klant wil in een discussie, dan moet dit onderbouwd zijn. In een discussie luister je eerst en vooral naar een ander zijn argumenten en denk je hierover na. Je filtert wat belangrijk is en overtuigd de andere persoon van hoe je er samen kan uitkomen.",
  "vision.learn.and.adapt": "Om vooruit te raken, moet je soms dingen herbekijken die in het verleden werden gedaan. Het vraagt moed om fouten uit het verleden toe te geven. Daarom is het belangrijk om samen te werken met vakmensen. Je kan dan wel trots zijn van je werk, als het beter kan, dan kan het beter. Best werk je samen met mensen die het hart op de juiste plaats hebben, dan met individuen die niet geven om het project of de organisatie.",
  "vision.knowledge.sharing": "Kennis delen met anderen is belangrijk. Je kan dit enerzijds doen door samen te werken (code reviews, pairen, etc.). Je kan ook sessies houden, waarbij je actief kennis overbrengt op anderen. Daarnaast is coaching, het schrijven van blogs, het lezen van boeken en het kijken van video's ook zeer waardevol. Door hier een actief deel van uit te maken, ga je als community vooruit.",
  "vision.customer.collaboration": "Samenwerken",
  "vision.long.term.relationships": "Om echt een verschil te kunnen maken voor een organistatie, werk je best een tijdje samen. Je bouwt een applicatie niet in een dag tijd. Door goed samen te werken, kan je wel veel bereiken op enkele maanden tijd. Maar de samenwerking hoeft dan nog niet te stoppen. Het is voor beide partijen fijn als je langdurig kan samenwerken, of dat je (wanneer nodig) beroep kan doen op externe expertise.",
  "vision.contract.negotiation": "Het is belangrijk dat de visie van de klant en van de ontwikkelaar hetzelfde is. Een goede samenwerking bekom je enkel indien je het gevoel hebt dat je werk ertoe doet. Als het fijn is om samen te werken, bereik je ook meer. De focus moet liggen op de samenwerking en niet op het contract.",
  "projects.title": "Projecten",
  "projects.subtitle": "We hebben allemaal ons verleden",
  "projects.intro": "Wat is het perfecte project? Dat is een moeilijke vraag om te beantwoorden. In de plaats van op technologie te focussen, zouden we ons moeten richten op het doel ervan. Elk project dat je doet draagt bij tot je als individu, maar het is de 'waarom' waarvoor je het doet. Hieronder kan je terugkijken op het verleden. Het geeft je een inzicht in mijn voorbije projecten. Heb jij iemand nodig voor een uitdaging die hier op aansluit? Neem dan zeker contact op!",
  "books.title": "Boeken",
  "books.subtitle": "Een schrijver start een boek en een lezer leest het uit",
  "books.intro": "Een van de beste manieren om kennis te vergaren is door te lezen. Dit hoeven geen technische boeken te zijn. Hieronder deel ik boeken die ik gelezen heb. Veel van deze boeken bevatten waardevolle informatie en tips, sommige meer als andere. Daarom heeft elk boek een score van nul tot vijf. Ze zijn heel divers, van uiterst technisch tot boeken die nadenken over hoe je met anderen omgaat.",
  "career.title": "Carrière",
  "career.subtitle": "Onze toekomst is het resultaat van keuzes uit het verleden",
  "career.intro": "Mijn passie voor software ontwikkeling ontstond niet bij mijn geboorte. Doorheen mijn studies vond ik wetenschappen, wiskunde en sport wel leuk. Bij het ouder worden, groeide ook mijn interesse. Ik leerde programmeren tijdens mijn studies en dit blijft me boeien tot op de dag van vandaag. Ik doe het ondertussen al meer als tien jaar, waarvan de laatste zes professioneel. Ik leer nog elke dag bij en dat doe ik met veel passie. Ik ben alvast benieuwd wat de toekomst voor mij in petto heeft!",
  "blog.subtitle": "Als schrijven gemakkelijk is, dan doe je iets fout",
  "blog.intro": "Het internet is gevuld met informatie. Ontwikkelaars maken hier gretig gebruik van voor onderzoek. Toegang hebben tot kennis is essentieel om je werk te kunnen doen en om te groeien. Als je ooit onderzoek gedaan hebt, dan begrijp je het belang van kennisdeling. Elke keer dat je moeilijk een antwoord vind op je vraag, dan krijg je de opportuniteit om een kwaliteitsvol artikel te schrijven. Dit is hoe we kunnen bijdragen aan ons netwerk. Dit is hoe we iets kunnen teruggeven."
}
